Wiznet/esp_wiz_toe/examples/network_install/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# Keep default warnings as warnings. ESP-IDF flipped this Kconfig default in 6.0
# (y in 5.5 -> n in 6.0). With it off the build uses -Werror instead of
# -Werror=all, so warnings outside -Wall become errors too -- including the
# preprocessor "redefined" warning the vendored ioLibrary trips. sdkconfig is
# gitignored, so without pinning it here the result depends on which IDF version
# happened to generate it first.
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
# --- wsm_driver shared settings (copied from loopback) ---
CONFIG_WSM_DRIVER_ENABLED=y
# Board = ESP32-W5500-Dev-kit, the component Kconfig default. The board fixes
# both the chip and the SPI pins; pick another one in menuconfig:
#   Component config -> WIZnet WSM Driver -> Board
CONFIG_WSM_DRIVER_BACKEND_TOE=y
# pins/clock come from the board selected above
# No BSD sockets here: this example only reads the chip's PHY registers, so the
# lwIP --wrap glue (and the ioLibrary close() rename it brings) is not needed.
CONFIG_WSM_DRIVER_SOCKET_WRAP=n
